[  
    {
        "role":"Head of Cloud Platform",
        "company":"Carfinance247",
        "summary":"I report directly to the CTO. I am responsible for our new Cloud Platform. I am responsible for the creation of, monitoring & governance of our new Azure Cloud Platform. This is a list of some of what this role entails: IaaS, PaaS, networking, security, cloud and application standards, cloud patterns, architecture, Developer eXperience (DX), CICD, failover, rollback, monitoring, dashboarding, security, governance, policy, automation, resource configuration and application performance (ensuring performant, high availability and resiliency).",
        "range":"Feb 2021 - Present"
    }, 
    {
        "role":"Principal Engineer",
        "company":"Carfinance247",
        "summary":"I report directly to the CTO. I work across teams to educate, assist & advise. I contribute to the active sprint. I work on side projects and PoC (proof of concept) projects. I have delivered brown bags on both AWS & Google Serverless services. I help to shape HLA, improve coding quality and engineering standards. I am a team player and help support my colleagues and CF247 operations whenever the opportunity arises. I provide direction and guidance on matters relating to cloud computing, architecting and developing for the cloud.  I am cloud first, a polyglot and an advocate of serverless technologies.",
        "range":"May 2019 - Jan 2021"
    },
    {
        "role":"Chief Technology Officer",
        "company":"Qualtrak Solutions",
        "summary":"I manage a team of remote workers around Europe to develop single server, HA & cloud based solutions using a range of technologies. I lead technical projects, architecturing product systems and feature solutions and coordinating integrations with partner/SI teams around the globe. The role is varied; ranging from technical presentations to CxO to root cause analysis.  I categorise myself as a CTO/developer with extensive serverless development experience. Reporting directly to the CEO.",
        "range":"Sept 2008 - Apr 2019"
    },
    {
        "role":"Contractor",
        "company":"Qualtrak Solutions",
        "summary":"I was employed originally to develop an API for a company’s client/server product.  This involved employing Unit testing techniques such as TDD and documentation software and then to ship to integration partners.        I was also awarded the project to design and develop an e-learning and coaching web platform, hosted on self-managed Rackspace servers.        The work gave me my first experience of AWS services.       I worked with partners & system integrators around the world.  I was asked to work full-time.",
        "range":"Jan 2007 - Sept 2008"
    },
    {
        "role":"Contractor",
        "company":"Various companies",
        "summary":"Using C# .NET and Javascript to create APIs and Web applications",
        "range":"Mar 2004 - Sept 2008"
    },
    {
        "role":"Contractor",
        "company":"Co-op",
        "summary":"I was commissioned to support and enhance solutions using ASP, ASP.NET, c#, javascript, HTML and CSS. This role also included supporting Cadbury’s with the Holos product (EIS). I was asked to work full-time.",
        "range":"2005 - Jan 2006"
    },
    {
        "role":"Client-side web developer Team Lead",
        "company":"AIM Technology",
        "summary":"I headed up the client-side development effort of a Scorecard web-application. This was eventually bought by Aspect.",
        "range":"Apr 2003 - 2004"
    },
    {
        "role":"Data Architect",
        "company":"AIM Technology",
        "summary":"My primary role was to consolidate data from disparate systems into a Scorecard application. My responsibilities included providing an OLAP solution, BI, data analytics, pre-sales support, product installation, support and diagnostics. I worked both onsite and offsite. Other duties included enhancing the corporate website.",
        "range":"Nov 2002 - Aug 2003"
    },
    {
        "role":"Technical Contractor",
        "company":"Toyota",
        "summary":"Computer support, process streamlining, help train department managers in best ways to collect data, check stock and compile aids for presentations and department workflow. I was also commissioned to compile a specification for a web based learning application to expedite the learning cycle for new intakes regarding site Health & Safety and the particular machines, and their components of a specific department.",
        "range":"Jul 2002 - Sept 2002"
    },
    {
        "role":"BI Consultant",
        "company":"GE Capital",
        "summary":"To develop and maintain a BI applications using the Holos BI tool.  My engagement was spread across several months.",
        "range":"Feb 2001 - Sept 2001"
    },
    {
        "role":"BI Consultant",
        "company":"Morgan Stanley Dean Witter",
        "summary":"To maintain a BI application using the Holos BI tool. Based at Canary Whalf",
        "range":"Nov 2000 - Sept 2000"
    },
    {
        "role":"BI Consultant",
        "company":"GUS",
        "summary":"To develop and maintain a BI applications using the Holos BI tool. Responsibilities included working closely with accounting department to translate requirements into features, assessment of work, development, support and maintenance.",
        "range":"Jan 2000 - Nov 2000"
    },
    {
        "role":"BI Consultant",
        "company":"Equitas",
        "summary":"I was brought in to develop and maintain a suite of BI applications using the Holos BI tool. My responsibilities included development, support, training, planning, managing a team of BI developers, assess / deliver on requirements, interface with other teams and to project management.",
        "range":"Mar 1998 - Dec 1999"
    },
    {
        "role":"Consultant",
        "company":"Crystal Decisions UK",
        "summary":"BI Support Engineer then BI Consultant.",
        "range":"1996 - 1998"
    },
    {
        "role":"Consultant",
        "company":"Lintel Software",
        "summary":"Informix DBA and developer.",
        "range":"1996 Mar - 1996 Oct"
    },
    {
        "role":"Developer",
        "company":"ITC",
        "summary":"Develop and maintain in house applications on a Unix platform using Recital language.",
        "range":"1994 - 1996"
    }
]